Aghosh993/Trinity2013/STM32F3x/src/main.cpp
#include "stm32f30x_adc.h"
#include "stm32f30x_gpio.h"
#include "stm32f30x_dma.h"

#include "stm32f3_discovery_l3gd20.h"

#include "encoder.h"
#include "pwm.h"
#include "debug.h"

#include <stdio.h>
#include <stdint.h>
#include <math.h>

/*
    This program (program referring to all source and header files in this repository (repository
    referring to https://github.com/Aghosh993/Trinity2013/tree) not containing code covered
    under the terms of STMicroelectronic's Liberty v2 License) is free software: you can redistribute
    it and/or modify it ("it" refers to all sections of this code as covered in the aforementioned way)
    under the terms of the GNU General Public License as published by the Free Software Foundation,
    either version 3 of the License, or (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program (please refer to the file COPYING in the root of
    the repository).  If not, see <http://www.gnu.org/licenses/>.

    (c) Abhimanyu Ghosh, Polytechnic Institute of NYU (2013-2014)
 */

/*
 * All other code is covered by the following terms:
 *
 *   ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
 */

/*
 * Timer usage manifest:
 *
 * TIM1: 16-bit PWM output mode (PE14) [for BLDC control...]
 * TIM2: 32-bit encoder interface input (PC6, PC7) (NOT ON TRINITY BOARD DUE TO HARDWARE FAULT!!)
 *
 * TIM3: PWM Output Channels 1 and 2 	(PB4, PB5)
 *
 * TIM4: 16-bit encoder interface input (PD12, PD13) (ONLY ON TRINITY BOARD, DUE TO ABOVE!!)
 *
 * TIM6: LED matrix ISR
 * TIM7: Encoder update ISR
 *
 * TIM8: 16-bit encoder interface input (PA0, PA1)
 *
 *
 * TIM17: IMU update ISR
 *
 * Other pins/resources used:
 *
 * Analog: 	PA2: adcData[0]
 * 			PA3: adcData[1]
 *
 * 			PA4: adc2_data[0]
 * 			PC4: adc2_data[1]
 * 			PC5: adc2_data[2]
 * 			PB2: adc2_data[3]
 *
 * Digital:
 *
 * Debug port information: Baud Rate=115200, 8n1 UART (TTL pins PA9, PA10)
 * 							PA9 = TX, PA10 = RX (W/respect to STM32 device)
 *
 * Purpose: Trinity 2013 (Theseus) Primary code development tree
 *
 */

/*
 * ADC TODO: Use PF4 for third channel in DMA setup for ADC1, then attempt to get DMA + continuous
 * conversion up and running in ADC3...? (Need more detailed datasheet reference...)
 */

volatile int led_iter;
volatile int led_matrix[7] = {GPIO_Pin_9, GPIO_Pin_8, GPIO_Pin_15, GPIO_Pin_13,
										GPIO_Pin_12, GPIO_Pin_11, GPIO_Pin_10};

void imu_update_ISR_init(void);
int16_t calc_gyro_bias(void);

uint32_t L3GD20_TIMEOUT_UserCallback(void);

void adc1_init_DMA(void);
void adc2_init_DMA(void);
void battery_watchdog_init(void);
void adc1_init(void);

void brake_pins_init(void);

void ping_pin_init(void);
void timer2_timebase_init(void);

void comp_init(void);

void trinity2013_waitForStart(void);

float IR_distance(int IR_ADC_VAL);

// Global variables to keep track of encoders and inertial sensors:

encoderState left_enc, right_enc;

volatile float gyro_angle_x;
int gyro_bias_x, adcval;

__IO uint32_t adcData[2];
int new_data;

__IO uint32_t adc2_data[4];
uint8_t adc2_new_data;

uint8_t adc3_awd1, adc3_awd2;

int count, stage;

float drive_cmd;// = 0.0f;
float err;// = 0.0f;
float last_err;// = 0.0f;
float diff_err;
float rt;// = 0.0f;
float d_front;// = 1.0f;
float integral;

float left, right;

int state;

float match_time_counter;
float t_firefight_start;
int leds_on;

// Initialize all encoder data structures to zero:

int main(void)
{
	SystemInit(); // Set up clocks/PLL/et. al

	UART1_init(); // Debug bridge

	state = ST_READY;

	LED_MATRIX_ISR_init();

	trinity2013_waitForStart();

	state = ST_WANDER;

	// Initialize ADC data buffers to 0;

	adcData[0] = 0;
	adcData[1] = 0;

	uint8_t iter = 0;
	for(iter=0; iter < 7; ++iter)
	{
		adc2_data[iter] = 0;
	}

	adc3_awd1 = 0;
	adc3_awd2 = 0;

	count = 0;
	stage = 0;

	/*
	 * Initialize global encoder data structure for left and right encoders,
	 * and set position/speed targets as necessary:
	 */

	init_encoder_struct(&left_enc);
	init_encoder_struct(&right_enc);

	// Initialize PWM outputs 1 and 2 at 5.0 kHz duty frequency:

	brake_pins_init();
	pwm_out1_init(2000);
	pwm_out2_init(2000);

	pwm_out3_init(50);

	// Initialize hardware quadrature encoder input interfaces:

	TIM8_init_encoder();
	TIM4_init_encoder();

	// Initialize ADC, encoder update, IMU update and LED matrix interrupts:

	new_data = 0;
	adc2_new_data = 0;

	// Initialize ADC1 DMA:
	adc1_init_DMA();

	// Initialize ADC2 DMA:
	adc2_init_DMA();

	//	battery_watchdog_init();

	encoder_update_ISR_init();	//Update the state of the two encoders (left/right)

	// Ping Sensor Init:

	ping_pin_init();
	timer2_timebase_init();
	imu_update_ISR_init();

	// Encoder comparator init for noise debounce:
	comp_init();

	adcval = 0;

	drive_cmd = 0.0f;
	err = 0.0f;
	last_err = 0.0f;
	diff_err = 0.0f;
	rt = 0.0f;
	d_front = 1.0f;
	integral = 0.0f;

	int uv_avgBuf1 = 0;
	int uv_avgBuf2 = 0;
	int uv_iter = 0;

	float uv1_avg, uv2_avg;

	LED_MATRIX_ISR_init();		//Hand out some eye candy while we're at it...
	leds_on = 0;

	while(true)
	{
		printf("%4d %4d %4d\n\r", (int)adcData[0] , (int)adc2_data[2], ((int)adcData[0] - (int)adc2_data[2]));
//		printf("%d %1.3f \n\r", (int)adc2_data[3], d_front);
//		printf("Time elapsed since start: %1.3f \n\r", match_time_counter);
		if(((adc2_data[2] > UV_THRESHOLD || adcData[0] > UV_THRESHOLD)) && state == ST_WANDER) //500
		{
			for(uv_iter=0; uv_iter<UV_NUMSAMPLES; ++uv_iter)
			{
				uv_avgBuf1 += (int)adcData[0];
				uv_avgBuf2 += (int)adc2_data[2];
			}
			uv1_avg = (float)uv_avgBuf1/(float)UV_NUMSAMPLES;
			uv2_avg = (float)uv_avgBuf2/(float)UV_NUMSAMPLES;

			if(uv1_avg > (float)UV_THRESHOLD || uv2_avg > (float)UV_THRESHOLD)
			{
				state = ST_HOMING;
			}

